[
    {
        "productName": "Apple iPhone 13",
        "briefDescription": "Apple iPhone 13 with A15 Bionic chip and 5G capabilities.",
        "price": 799,
        "discount": "10% off",
        "featureParagraph": "The iPhone 13 offers a stunning Super Retina XDR display, advanced dual-camera system, and up to 19 hours of video playback. It is designed to deliver superior performance with the A15 Bionic chip, making it perfect for multitasking and gaming.",
        "imageLink": "https://example.com/iphone13.jpg"
    },
    {
        "productName": "Samsung 55\" QLED 4K Smart TV",
        "briefDescription": "Samsung 55-inch QLED 4K Smart TV with Quantum Dot technology.",
        "price": 899,
        "discount": "15% off",
        "featureParagraph": "Experience cinematic viewing with the Samsung QLED 4K Smart TV. It features Quantum Dot technology for vivid colors and crisp details, along with smart capabilities to access your favorite streaming services with ease.",
        "imageLink": "https://example.com/samsung55qled.jpg"
    },
    {
        "productName": "Ninja Professional Blender",
        "briefDescription": "Ninja Professional Blender with 1000-Watt base and Total Crushing Technology.",
        "price": 99,
        "discount": "20% off",
        "featureParagraph": "The Ninja Professional Blender is a powerful kitchen appliance that effortlessly crushes ice, whole fruits, and vegetables for smooth and nutritious drinks. Its Total Crushing Technology ensures perfect results every time.",
        "imageLink": "https://example.com/ninjablender.jpg"
    },
    {
        "productName": "Dyson V11 Cordless Vacuum Cleaner",
        "briefDescription": "Dyson V11 Cordless Vacuum Cleaner with powerful suction and intelligent cleaning modes.",
        "price": 599,
        "discount": "5% off",
        "featureParagraph": "The Dyson V11 adapts intelligently to different floor types, offering up to 60 minutes of fade-free power. With its advanced whole-machine filtration, it captures 99.99% of dust particles as small as 0.3 microns.",
        "imageLink": "https://example.com/dysonv11.jpg"
    },
    {
        "productName": "Instant Pot Duo 7-in-1 Electric Pressure Cooker",
        "briefDescription": "Instant Pot Duo 7-in-1 Electric Pressure Cooker with 14 one-touch programs.",
        "price": 89,
        "discount": "25% off",
        "featureParagraph": "The Instant Pot Duo combines seven kitchen appliances in one, including a pressure cooker, slow cooker, rice cooker, steamer, sauté pan, yogurt maker, and warmer. It simplifies meal preparation and saves time.",
        "imageLink": "https://example.com/instantpotduo.jpg"
    },
    {
        "productName": "Fitbit Charge 5",
        "briefDescription": "Fitbit Charge 5 Advanced Fitness & Health Tracker with built-in GPS.",
        "price": 149,
        "discount": "10% off",
        "featureParagraph": "Track your fitness journey with the Fitbit Charge 5. It includes advanced health metrics like stress management, heart rate variability, and oxygen saturation monitoring. The built-in GPS allows for precise tracking of outdoor activities.",
        "imageLink": "https://example.com/fitbitcharge5.jpg"
    },
    {
        "productName": "Keurig K-Elite Coffee Maker",
        "briefDescription": "Keurig K-Elite Single Serve Coffee Maker with iced coffee setting.",
        "price": 139,
        "discount": "15% off",
        "featureParagraph": "Brew your favorite coffee in minutes with the Keurig K-Elite. It offers a strong brew option, an iced coffee setting, and a large 75-ounce water reservoir, making it perfect for home or office use.",
        "imageLink": "https://example.com/keurigkelite.jpg"
    },
    {
        "productName": "Sony WH-1000XM4 Wireless Noise-Cancelling Headphones",
        "briefDescription": "Sony WH-1000XM4 Over-Ear Wireless Noise-Cancelling Headphones.",
        "price": 349,
        "discount": "10% off",
        "featureParagraph": "Experience industry-leading noise cancellation with the Sony WH-1000XM4. These headphones offer superior sound quality, long battery life, and advanced features like touch control and adaptive sound for a personalized listening experience.",
        "imageLink": "https://example.com/sonywh1000xm4.jpg"
    }
]